-- Анализ рынка вакансий на должность аналитика 

-- 1. Определяем диапазон заработных плат.
SELECT  
	ROUND(AVG(salary_from), 0) AS avg_salary_from,
	ROUND(AVG(salary_to), 0) AS avg_salary_to,
	MIN(salary_from) AS min_salary_from, 
	MAX(salary_from) AS max_salary_from, 
	MIN(salary_to) AS min_salary_to, 
	MAX(salary_to) AS mix_salary_to
FROM 
	public.parcing_table;

--------------------+---------------+-----------------+-----------------+---------------+---------------+
--  avg_salary_from | avg_salary_to | min_salary_from | max_salary_from | min_salary_to | max_salary_to |
--------------------+---------------+-----------------+-----------------+---------------+---------------+
--           109525 |        153847 |              50 |          398000 |         25000 |        497500 |
--------------------+---------------+-----------------+-----------------+---------------+---------------+

-- Средняя зарплата в категории «от» составляет 109525 рублей,  
-- в категории «до» — 153847 рублей. Это указывает на то, что работодатели готовы платить
-- аналитикам в среднем около 131000 рублей. 
-- Минимальная предлагаемая зарплата начинается с 50 рублей,
-- что, предполагаемо, является ошибкой данных, 
-- максимальная достигает 497500 рублей.


-- 2. Выявляем регионы и компании, в которых сосредоточено наибольшее количество вакансий.
-- 2.1 Количество вакансий по городам, ТОП-5.

SELECT 
	count(id) AS count_ads, 
	area AS city_name
FROM 
	public.parcing_table
GROUP BY 
	area
ORDER BY 
	count_ads DESC
LIMIT 
	5;

-------------+-----------------+
-- count_ads | 	  city_name    |
-------------+-----------------+
--     1247  | Москва	       |
--      181  | Санкт-Петербург |
--       51  | Екатеринбург    |
--       33  | Нижний Новгород |
--       33  | Новосибирск     |
-------------+-----------------+

-- Лидер по предложениям о работе - Москва, 
-- на втором месте - Санкт-Петербург, 
-- также активно ищут аналитиков в Екатеринбурге, Нижнем Новгороде и Новосибирске.

-- 2.2 Количество вакансий по нанимателям, ТОП-5.
SELECT 
	count(id) AS count_ads, 
	employer AS company_name 
FROM 
	public.parcing_table
GROUP BY 
	employer
ORDER BY 
	count_ads DESC 
LIMIT 
	5;

-------------+-----------------+
-- count_ads |  company_name   |
-------------+-----------------+
--	 243 |	СБЕР	       |
--	  43 |	WILDBERRIES    |
--	  34 |	Ozon	       |
--	  28 |	Банк ВТБ (ПАО) |
--	  26 |	Т1	       |
-------------+-----------------+

-- Лидером по поиску аналитиков является СБЕР, одна из крупнейших компаний на территории РФ.
-- Также в ТОП 5 попали: WILDBERRIES, Ozon, Банк ВТБ (ПАО) и Т1.
-- По данным видно, что банковский сектор, активнее других, расширяет звено аналитиков.

-- 3. Проанализируем, какие преобладают типы занятости, а также графики работы.
-- 3.1 Количество вакансий по типу занятости.

SELECT 
	count(id) AS count_ads, 
	employment 
FROM 
	public.parcing_table
GROUP BY 
	employment
ORDER BY 
	count_ads DESC;

-------------+----------------------+
-- count_ads |      employment	    |
-------------+----------------------+		
-- 	1764 |	Полная занятость    |
-- 	  16 |	Частичная занятость |
-- 	  16 |	Стажировка          |
-- 	   5 |	Проектная работа    |
-------------+----------------------+

-- Абсолютное большинство компаний нуждаются в аналитиках на полную ставку.

-- 3.2 Количество вакансий по графикам работы.

SELECT 
	count(id) AS count_ads, 
	schedule 
FROM 
	public.parcing_table
GROUP BY  
	schedule
ORDER BY  
	count_ads DESC;

-------------+-------------------+
-- count_ads | 	   schedule	 |
-------------+-------------------+
--	1441 |	Полный день	 |
--	 310 |	Удаленная работа |
--	  41 |	Гибкий график    |
--	   9 |	Сменный график   |
-------------+-------------------+

-- Большинство нанимателей предпочитают стандартный график работы (пн-пт),
-- на второй позиции размещается удалённая работа - 310 вакансий.
-- редко встречаются гибкий и сменный графики.

-- 4. Распределение грейдов среди аналитиков данных и системных аналитиков.

SELECT 
	experience,
	count(id) AS count_ads, 
	ROUND(COUNT(*) * 100.0 / (
		SELECT 
			COUNT(*) 
		FROM 
			public.parcing_table 
		WHERE 
			name LIKE '%Аналитик данных%' OR name LIKE '%Системный аналитик%'
	), 2) AS percent_ads
FROM 
	public.parcing_table
WHERE 
	name LIKE '%Аналитик данных%' OR name LIKE '%Системный аналитик%'
GROUP BY
	experience
ORDER BY 
	count_ads DESC;

-------------------------+--------------+---------------+
-- 	experience	 |  count_ads	|   percent_ads |
-------------------------+--------------+---------------+
--  Junior+ (1-3 years)	 |	751	|	64.91   |
--  Middle (3-6 years)	 |	296	|	25.58   |
--  Junior (no experince)|	105	|	 9.08   |
--  Senior (6+ years)	 |	  5	|	 0.43   |
-------------------------+--------------+---------------+

-- Большинство вакансий для аналитиков данных и системных аналитиков предназначены
-- для специалистов уровня Junior+ (64.91%) и Middle (25.58%). Это подтверждает высокую 
-- потребность в специалистах начального и среднего уровней. 

-- 5. Топ-5 основных работодателей, предлагаемых зарплат и условий труда для аналитиков.

SELECT 
	employer AS company_name,
	count(*) AS count_ads,
	ROUND(AVG(salary_from), 0) AS avg_salary_from,
	ROUND(AVG(salary_to), 0) AS avg_salary_to,
	employment,
	schedule
FROM 
	public.parcing_table
WHERE 
	name LIKE '%Аналитик данных%' OR name LIKE '%Системный аналитик%'
GROUP BY
	employer, employment, schedule
ORDER BY 
	count_ads DESC
LIMIT 
	5;

---------------------------------+--------------+---------------+--------------+----------------+--------------------+
-- 	company_name		 |  count_ads	|avg_salary_from| avg_salary_to|   employment	|	schedule     |
---------------------------------+--------------+---------------+--------------+----------------+--------------------+
--	СБЕР			 |	103	|	112000	|        73333 |  Полный день	|   Полная занятость |
--	Банк ВТБ (ПАО)		 |	 25	|	  NULL	|         NULL |  Полный день	|   Полная занятость |
--	Ozon			 |	 18	|	  NULL	|         NULL |  Полный день	|   Полная занятость |
--	Т1			 |	 17	|	  NULL	|         NULL |  Полный день	|   Полная занятость |
--	Правительство Москвы     |	 15	|	  NULL	|         NULL |  Полный день	|   Полная занятость |
---------------------------------+--------------+---------------+--------------+----------------+--------------------+

-- Как основной работодатель, для аналитиков данных и системных аналитиков, выделяется СБЕР.
-- Компания предлагает 103 вакансии с показаелями средней зарплаты "ОТ" - 112000 рублей, и, "ДО" - 73333 рублей.
-- Средняя зарплата «ДО» ниже средней зарплаты «ОТ», так как СБЕР в большинстве вакансий указыват только сумму зарплаты "ОТ". 
-- Основной тип занятости в данной компании — полная занятость с полным рабочим днём.
-- Банк ВТБ (ПАО), Ozon, Т1 и Правительство Москвы также предлагают достаточно вакансий с аналогичными условиями занятости.
-- Заработную плату у данных компаний определяют по результатам собеседования.

-- 6. Наиболее востребованные навыки для аналитиков.

SELECT 	
	key_skills_1,
	count(*) AS ads_count
FROM 
	public.parcing_table
GROUP BY 
	key_skills_1
ORDER BY  
	count(*) DESC
LIMIT  
	6;

-----------------+------------+
-- key_skills_1	 |  ads_count |
-----------------+------------+
--		 |	  383 |
-- Анализ данных |	  312 |
-- SQL		 |	  161 |
-- Документация	 |	   89 |
-- MS SQL	 |	   87 |
-- Pandas	 |	   86 |
-----------------+------------+

SELECT 	
	key_skills_2,
	count(*) AS ads_count
FROM 
	public.parcing_table
GROUP BY
	key_skills_2
ORDER BY 
	count(*) DESC
LIMIT 
	6;

-----------------+------------+
-- key_skills_2	 |  ads_count |
-----------------+------------+
--		 |	  641 |
-- SQL		 |	  318 |
-- Python	 |	  142 |
-- Коммуникация	 |	   64 |
-- Анализ данных |	   62 |
-- Power BI	 |	   38 |
-----------------+------------+

SELECT 	
	key_skills_3,
	count(*) AS ads_count
FROM 
	public.parcing_table
GROUP BY 
	key_skills_3
ORDER BY 
	count(*) DESC
LIMIT 
	6;

-----------------+------------+
-- key_skills_3	 |  ads_count |
-----------------+------------+
--		 |	  753 |
-- SQL		 |	  220 |
-- Python	 |	  130 |
-- Power BI	 |	   62 |
-- Документация	 |	   61 |
-- Коммуникация	 |	   34 |
-----------------+------------+

SELECT 	
	key_skills_4,
	count(*) AS ads_count
FROM 
	public.parcing_table
GROUP BY 
	key_skills_4
ORDER BY 
	count(*) DESC
LIMIT 
	6;

---------------------------------------+------------+
-- key_skills_4		               |  ads_count |
---------------------------------------+------------+
--				       |	864 |
-- Python			       |	113 |
-- SQL				       | 	 61 |
-- Работа с большим объемом информации |	 47 |
-- Документация			       |	 47 |
-- Power BI			       |	 42 |
---------------------------------------+------------+

-- Работодатели нуждаются в специалистах, обалающих следующими профессиональными навыками (hard skills):
-- анализ данных, SQL, Python, работа с большим объемом информации, работа с документацией, Power BI.

SELECT 	
	soft_skills_1,
	count(*) AS ads_count
FROM 
	public.parcing_table
GROUP BY 
	soft_skills_1
ORDER BY 
	count(*) DESC
LIMIT 
	6;

--------------------------+---------------+
-- soft_skills_1	  | 	ads_count |
--------------------------+---------------+
--			  |	     1213 |
-- Документация		  |	      234 |
-- Коммуникация		  |	      181 |
-- Аналитическое мышление |	      109 |
-- Проактивность	  |	       37 |
-- Креативность		  |	       11 |
--------------------------+---------------+

SELECT 	
	soft_skills_2,
	count(*) AS ads_count
FROM 
	public.parcing_table
GROUP BY 
	soft_skills_2
ORDER BY 
	count(*) DESC
LIMIT 
	6;

--------------------------+---------------+
-- soft_skills_2	  |    ads_count  |
--------------------------+---------------+
-- 			  |	     1691 |
-- Документация		  |	       46 |
-- Аналитическое мышление |	       32 |
-- Проактивность	  |	       13 |
-- Переговоры		  |	        9 |
-- Решение проблем	  |	        4 |
--------------------------+---------------+

SELECT 	
	soft_skills_3,
	count(*) AS ads_count
FROM 
	public.parcing_table
GROUP BY 
	soft_skills_3
ORDER BY 
	count(*) DESC
LIMIT 
	6;

---------------------------+--------------+
-- soft_skills_3	   | 	ads_count |
---------------------------+--------------+
--			   |	     1779 |
-- Аналитическое мышление  |	        9 |
-- Проактивность	   |	        3 |
-- Переговоры		   |	        3 |
-- Креативность		   |	        3 |
-- Презентация результатов |	        3 |
---------------------------+--------------+

SELECT 	
	soft_skills_4,
	count(*) AS ads_count
FROM 
	public.parcing_table
GROUP BY 
	soft_skills_4
ORDER BY 
	count(*) DESC;

--------------------------+---------------+
-- soft_skills_4	  | 	ads_count |
--------------------------+---------------+
--			  |	     1796 |
-- Внимание к деталям	  |	        3 |
-- Аналитическое мышление |	        2 |
--------------------------+---------------+

-- Работодатели ищут в специалистах следующие личностные качества (soft skills):
-- коммуникативность, аналитическое мышление, Креативность, проактивность, внимание к деталям.


